"""
字面量是指程序中，直接书写的固定值，用来表示数据或者内容
    整数: 10 0 -5
    浮点数/小数: 8.5 3.14 1.0 - 3.5
    布尔: 表达现实生活中的逻辑，真或假 True False
    字符串: 描述文本的一种数据类型   "人生苦短，我用Python"
    空值: 表示空或无值，仅包含一个值None  None
    数据容器: 存储多项数据的容器 列表 / 元组 / 集合 / 字典 （后面详细讲解）
"""


# 整数: 10 0 -5
print(10)
print(0)
print(-5)
print("-----------------")

# 浮点数/小数: 8.5 3.14 1.0 - 3.5
print(8.5)
print(3.14)
print(1.0)
print(-3.5)
print("-----------------")

# 布尔: 表达现实生活中的逻辑，真或假 True False
print(True)
print(False)
print("-"*20)

# 字符串: 描述文本的一种数据类型   "人生苦短，我用Python"
print("人生苦短，我用Python")
print("-"*20)

# 空值: 表示空或无值，仅包含一个值None  None
print(None)

# 数据容器: 存储多项数据的容器 列表 / 元组 / 集合 / 字典 （后面详细讲解）