"""
+   加法 1 + 5：1加上5
-   减法 8 – 3 ：8减3
*   乘法 3 * 8 ：3乘以8
/   除法 10 / 5 ：10除以5，除法结果是小数
//  整除 10 // 3 ：10整除3，，整除结果为真实结果的整数部分
%   取余/求模  10 % 3 ：10模于3，结果为1（10除3取余数）
**  幂指数    10 ** 3 ：10的3次方
"""
a = 11
b = 4

# + 加法 1 + 5：1加上5
print(a + b)  # 15

# - 减法 8 – 3 ：8减3
print(a - b)  # 7

# * 乘法 3 * 8 ：3乘以8
print(a * b)  # 44

# / 除法 10 / 5 ：10除以5，除法结果是小数
print(a / b)  # 2.75
print(10 / 2)  # 5.0

# //    整除 10 // 3 ：10整除3，整除结果为整数
print(a // b)  # 2

# % 取余/求模  10 % 3 ：10模于3，结果为1（10除3取余数）
print(a % b)  # 3

# **    幂指数    10 ** 3 ：10的3次方
print(2 ** 3)  # 8
print(3 ** 2)  # 9
