"""
=   赋值运算符
+=  加法赋值运算符
-=  减法赋值运算符
*=  乘法赋值运算符
/=  除法赋值运算符
%=  取模赋值运算符
//= 取整除赋值运算符
**= 幂赋值运算符
"""

# 定义变量
# a = 10
# b = 3
a, b = 10, 3

# +=  加法赋值运算符
a += b  # a += b ---> a = a + b ---> a = 10 + 3
print(a)  # 13

# -=  减法赋值运算符
a -= b  # a -= b ---> a = a - b ---> a = 13 - 3
print(a)  # 10

# *=  乘法赋值运算符
a *= b  # a *= b ---> a = a * b ---> a = 10 * 3
print(a)  # 30

# /=  除法赋值运算符(小数)
a /= b  # a /= b ---> a = a / b ---> a = 30 / 3
print(a)  # 10.0

# %=  取模赋值运算符
a %= b  # a %= b ---> a = a % b ---> a = 10.0 % 3
print(a)  # 1.0

# //= 取整除赋值运算符
a //= b  # a //= b ---> a = a // b ---> a = 1.0 // 3
print(a)  # 0.0

# **= 幂赋值运算符
a **= b  # a **= b ---> a = a ** b ---> a = 0.0 ** 3
print(a)  # 0.0