"""
比较运算符，也称为关系运算符，用于比较两个值之间的关系是否成立，它的返回结果是一个布尔类型
等于  ==   (注意: == 代表比较运算符   = 代表的是赋值运算符)
不等于 !=
大于 >
大于等于 >=  (大于或者等于)
小于 <
小于等于 <=  (小于或者等于)
"""

# 等于  ==   (注意: == 代表比较运算符   = 代表的是赋值运算符)
print(f"10 == 5 :{10==5}")
print(f"10 == 10.0 :{10==10.0}")

# 不等于 !=
print(f"10 != 5 :{10!=5}")
print(f"10 != 10.0 :{10!=10.0}")

# 大于 >
print(f"10 > 5 :{10>5}")
print(f"10 > 10.0 :{10>10.0}")

# 大于等于 >=  (大于或者等于)
print(f"10 >= 5 :{10>=5}")
print(f"10 >= 10.0 :{10>=10.0}")

# 小于 <
print(f"10 < 5 :{10<5}")
print(f"10 < 10.0 :{10<10.0}")

# 小于等于 <=  (小于或者等于)
print(f"10 <= 5 :{10<=5}")
print(f"10 <= 10.0 :{10<=10.0}")